use Library

GO
--Создаем процедуру для вставки данных во временную табилцу

Create Procedure InsertFromNoteInTempTable As
Begin
--Удаляем временную таблицу если есть, чтобы данные не повторялись
Drop Table if exists  ##TempTable

--Создаем Временную таблицу
CREATE TABLE ##TempTable
(Author nvarchar(200),
Book nvarchar(300),
YearPublication int)

INSERT INTO ##TempTable (Author, Book, YearPublication) 
Values
(N'Автор1',N'Книга1',2001),
(N'Автор1',N'Книга2',2011),
(N'Автор1',N'Книга2',2021),
(N'Автор2',N'Книга3',2005),
(N'Автор2',N'Книга4',2022),
(N'Автор1',N'Книга1',2012),
(N'Автор4',N'Книга6',1990),
(N'Автор3',N'Книга5',1985),
(N'Автор9',N'Книга7',1998),
(N'Автор1',N'Книга8',2000),
(N'Автор7',N'Книга9',2007),
(N'Автор1',N'Книга10',2014),
(N'Автор1',N'Книга10',2018),
(N'Author7',N'Book11',2020),
(N'Автор2',N'Книга1',2012),
(N'Автор5',N'Книга6',1990),
(N'Автор6',N'Книга5',1985),
(N'Автор9',N'Книга7',1998),
(N'Автор2',N'Книга8',2000),
(N'Автор3',N'Книга8',2000),
(N'Автор12',N'Книга9',2007),
(N'Автор1',N'Книга9',2007),
(N'Автор2',N'Книга10',2014),
(N'Автор3',N'Книга10',2014),
(N'Автор4',N'Книга10',2014),
(N'Автор3',N'Книга10',2018),
(N'Автор5',N'Книга10',2018),
(N'Автор2',N'Книга10',2018),
(N'Автор4',N'Книга10',2018)
End;
